thucnguyen12/gd32/Template/main.c
/*!
    \file    main.c
    \brief   led spark with systick, USART print and key example
    
    \version 2019-02-19, V1.0.0, firmware for GD32E23x
    \version 2020-12-12, V1.1.0, firmware for GD32E23x
*/

/*
    Copyright (c) 2020, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#include "gd32e23x.h"
#include "systick.h"
#include <stdio.h>
#include "main.h"
#include "gd32e230c_eval.h"
#include "board_hw/board_hw.h"
#include "lwrb/include/lwrb/lwrb.h"
#include "min_protocol/min.h"
#include "min_protocol/min_id.h"
#include "app_mqtt_protocol/include/app_mqtt.h"
#include "flash.h"
#include "gd32e23x_it.h"
#include "u8g2.h"
#include "app_debug.h"
#include "SEGGER_RTT.h"
#include "SEGGER_RTT_Conf.h"

#define APP_GD32_SPI_TOKEN      0x6699

#define RTC_CLOCK_SOURCE_IRC40K
#define BKP_VALUE    0x32F0

#define LCD_HORIZONTAL 128
#define LCD_VERTICAL 64

#define LCD_MEASURE_X_CENTER(x) ((LCD_HORIZONTAL - x) / 2)
#define LCD_MEASURE_Y_CENTER(x) ((LCD_VERTICAL - x) / 2)

#define APP_SPI_PING_MSG    0x01
#define APP_SPI_BEACON_MSG  0x02
#define APP_SPI_KEY_CONFIG 0x03
#define APP_SPI_SYN_TIME 0x04

#define MAX_BEACON_SENSOR 10


// defination about device type
#define APP_DEVICE_GW                               (0x00)      /*<Message in mesh network sent from gateway>*/
#define APP_DEVICE_SENSOR_FIRE_DETECTOR             (0x01)      
#define APP_DEVICE_SENSOR_SMOKE_DETECTOR            (0x02)
#define APP_DEVICE_BUTTON_SOS                       (0x03)
#define APP_DEVICE_SPEAKER                          (0x04)
#define APP_DEVICE_SENSOR_TEMP_DETECTOR             (0x05)
#define APP_DEVICE_SENSOR_DOOR_DETECTOR             (0x06)
#define APP_DEVICE_SENSOR_PIR_DETECTOR              (0x07)
#define APP_DEVICE_TOUCH_LIGHT                      (0x08)
#define APP_DEVICE_TOUCH_WATER_WARMER               (0x09)
#define APP_DEVICE_TOUCH_AIR_CON                    (0x0A)
#define APP_DEVICE_SENSOR_TEMP_SMOKE                (0x0B)
#define APP_DEVICE_POWER_METER                      (0x0C)
#define APP_DEVICE_UNKNOWN                          (0xFE)
#define APP_DEVICE_MAX                              (0xFF)

//time defination
#define FIRSTYEAR 2000 // start year
#define FIRSTDAY 6	   // 0 = Sunday

typedef struct
{
	uint8_t year;
	uint8_t month;
	uint8_t day;
	uint8_t hour;
	uint8_t minute;
	uint8_t second;
	uint8_t weekday;
} date_time_t;

static const uint8_t day_in_month[12] = {31, 29, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31};

typedef enum
{
	NO_CONNECT,
	WIFI_CONNECT,
	ETH_CONNECT,
	GSM_CONNECT
} network_status_t;

typedef struct
{
	uint32_t timestamp;
	network_status_t  network_status;
	bool need_update_time;
} esp_status_infor_t;




typedef struct __attribute((packed))
{
    uint8_t netkey[16];
    uint8_t appkey[16];
} app_provision_key_t;

typedef union
{
     struct __attribute((packed))
     {
         uint16_t token;
         uint8_t msg_id;
         uint8_t msg_length;
         uint8_t payload[251];
     }format;
     uint8_t value[255];
}nrf52_format_packet_t;

typedef union {
    struct AlarmState_t {
      uint16_t ALARM_CENTER_BUTTON : 1;                                
      uint16_t ALARM_REMOTE : 1;                
      uint16_t ALARM_SMOKE : 1;                
      uint16_t ALARM_DOOR : 1;        
      uint16_t ALARM_PIR : 1;                
      uint16_t ALARM_TEMP : 1;                
      uint16_t ALARM_SFUL02_IO : 1;
      uint16_t ALARM_SFUL02_DTMF : 1;
      uint16_t ALARM_SFUL02_FIREBOX_FAULTY : 1;
      uint16_t ALARM_SFUL02_ISO_IN3 : 1;
      uint16_t ALARM_SFUL02_ISO_IN4 : 1;
      uint16_t ALARM_FIRE : 1;
      uint16_t ALARM_BUZZER_LAMP : 1;
      uint16_t ALARM_COMBINE_TEMP_SMOKE : 1;
      uint16_t NA : 2;
    } Name;
    uint16_t Value;
} DeviceAlarmStatus_t;



typedef struct 
{
  DeviceAlarmStatus_t alarm_value;
  uint16_t sensor_count;
  uint8_t gateway_mac[6];
  app_provision_key_t mesh_key;
  uint8_t in_pair_mode;
} __attribute((packed)) app_beacon_ping_msg_t;

typedef union 
{
    struct 
    {
        uint8_t tid : 4;
        uint8_t version : 4;    // limited 16 version
    } __attribute((packed)) info;
    uint8_t value;
} __attribute((packed)) app_beacon_tid_t;

typedef union 
{
    struct Properties_t
    {
        uint16_t deviceType : 6;        
        uint16_t alarmState : 1;
        uint16_t isNewMsg : 1;
        uint16_t isPairMsg : 1;
        //uint16_t fwVersion : 5;
        uint16_t comboSensor : 1;
        uint16_t reserve : 10;
    } Name;
    uint16_t Value;
} __attribute((packed)) node_proprety_t;

typedef struct
{
    uint8_t Data[14];
    uint8_t Len;
    uint8_t IsCustom;
} node_custom_data_t;

typedef struct 
{
  uint8_t device_mac[6];
  //uint8_t device_type;// Maybe Bitfield
  app_beacon_tid_t beacon_tid;
  uint8_t battery;
  uint8_t is_data_valid;  // Maybe Bitfield 
  uint8_t fw_verison;
  //uint8_t msg_type;
  uint8_t teperature_value;
  uint8_t smoke_value;
  uint32_t timestamp; /*<Current tick when receive this value>*/
  node_proprety_t propreties; /*Node's Propreties*/
  node_custom_data_t custom_data;
} __attribute((packed)) app_beacon_data_t;

typedef struct __attribute ((packed))
{
   uint8_t device_mac[6];
   uint8_t device_type;
   bool pair_success;
} beacon_pair_info_t;

