thucnguyen12/gd32/Template/main.c
typedef union __attribute((packed))
{
    struct  
    {
        uint8_t config_netkey : 1;
        uint8_t config_appkey : 1;
        uint8_t config_IVindex : 1;
        uint8_t config_seqnumber :1;
        uint8_t config_speaker : 1;
        uint8_t config_alarm : 1;
        uint8_t config_mac   : 1;
        uint8_t reseverd     : 1;
    };
    uint8_t value;
} config_in_need;

typedef union {
    struct Alarms_t {
        uint8_t EnableBuzzer : 1;
        uint8_t EnableSyncAlarm : 1;
        uint8_t EnableAlarmPower : 1;
        uint8_t reserver : 5;
    } Name;
    uint8_t Value;
} AlarmConfig_t;

typedef struct
{
    config_in_need config;
    //app_provision_key_t provision;
    uint8_t netkey[16];
    uint8_t appkey[16];
    uint8_t speaker;
    AlarmConfig_t alarm;
    uint32_t iv_index;
    uint32_t sequence_number;
    uint8_t mac[6];
}__attribute((packed)) ble_config_t;

bool esp32_started_s = false;

lwrb_t uart_rb;
uint8_t uart_buffer[512];
uint8_t min_txbuffer[1024];

uint8_t min_rx_buffer[1024];
min_context_t m_min_context;
min_frame_cfg_t m_min_setting;

uint8_t spi_header[2];
uint8_t spi_data_send_ping[256];
uint8_t spi_data_send[256];
uint8_t spi_data_recieve[256];
bool ready_to_send = false;
// LCD RELATE VAR
typedef struct __attribute((packed))
{
    char MAC[6];
    uint8_t  deviceType;
    date_time_t time_got_trouble;
} trouble_info_of_note_t;

static trouble_info_of_note_t trouble_table_info_of_note [MAX_BEACON_SENSOR];
bool there_are_trouble = false;
// LCD VAR end

// esp32 info var
esp_status_infor_t esp_status_infor;
network_status_t network_status;

//min var
uint8_t min_data_send [256];


static const min_msg_t ping_min_msg = {
    .id = MIN_ID_PING_ESP_ALIVE,
    .len = 0,
    .payload = NULL
};

u8g2_t m_u8g2;
static void delay_ns(uint32_t ns);
uint8_t u8g2_gpio_8080_update_and_delay(U8X8_UNUSED u8x8_t *u8x8,
										U8X8_UNUSED uint8_t msg,
										U8X8_UNUSED uint8_t arg_int,
										U8X8_UNUSED void *arg_ptr);

bool check_ping_esp_s = false;

rtc_timestamp_struct rtc_timestamp;
rtc_tamper_struct rtc_tamper;
rtc_parameter_struct rtc_initpara;
__IO uint32_t prescaler_a = 0, prescaler_s = 0;


// spi var
volatile uint32_t send_n = 0, receive_n = 0;
uint8_t spi0_send_array[ARRAYSIZE];
uint8_t spi0_receive_array[ARRAYSIZE];
uint8_t spi_data_flag = 0;
volatile uint32_t sys_counter;


//PROTOTYPE PLACE
void irc40k_config(void);
static uint8_t convert_input_to_bcd_format(uint8_t value);
uint8_t convert_bcd_to_dec (uint8_t bcd);
void rtc_setup(date_time_t *t);
void rtc_pre_config(void);
void rtc_show_timestamp(void);
void update_time(uint32_t timestamp);
uint32_t convert_date_time_to_second(date_time_t *t);

uint8_t get_weekday(date_time_t time);

void convert_second_to_date_time(uint32_t sec, date_time_t *t, uint8_t Calyear);

uint8_t request_spi_message(uint8_t* p_out, uint8_t MSG_ID, void* input);
//PROTOTYPE PLACE END    


/*!
    \brief      configure the SPI peripheral
    \param[in]  none
    \param[out] none
    \retval     none
*/
void spi_config(void)
{
    gpio_bit_set (GPIO_NRF_CS_PORT, GPIO_NRF_CS_PIN);
    spi_parameter_struct spi_init_struct;
    
    /* deinitilize SPI and the parameters */
    spi_i2s_deinit(SPI0);
//    spi_i2s_deinit(SPI1);
    rcu_periph_clock_enable(RCU_SPI0);
    spi_struct_para_init(&spi_init_struct);

    /* configure SPI0 parameter */
    spi_init_struct.trans_mode           = SPI_TRANSMODE_FULLDUPLEX;
    spi_init_struct.device_mode          = SPI_MASTER;
    spi_init_struct.frame_size           = SPI_FRAMESIZE_8BIT;
    spi_init_struct.clock_polarity_phase = SPI_CK_PL_LOW_PH_1EDGE;
    spi_init_struct.nss                  = SPI_NSS_SOFT;
    spi_init_struct.prescale             = SPI_PSC_64;
    spi_init_struct.endian               = SPI_ENDIAN_MSB;
    spi_init(SPI0, &spi_init_struct);

    /* configure SPI1 parameter */
//    spi_init_struct.trans_mode           = SPI_TRANSMODE_FULLDUPLEX;
//    spi_init_struct.device_mode          = SPI_SLAVE;
//    spi_init(SPI1, &spi_init_struct);

    /* configure SPI1 byte access to FIFO */
//    spi_fifo_access_size_config(SPI1, SPI_BYTE_ACCESS);

#if SPI_CRC_ENABLE
    /* configure SPI CRC function */
    spi_crc_length_set(SPI1, SPI_CRC_8BIT);
    spi_crc_polynomial_set(SPI0, 7);
    spi_crc_polynomial_set(SPI1, 7);
    spi_crc_on(SPI0);
    spi_crc_on(SPI1);
#endif /* enable CRC function */
}

//example for transmit data

//void spi_send_data (uint8_t* data, uint8_t size)
//{
//    while(RESET == spi_i2s_flag_get(SPI0, SPI_FLAG_TBE)) {
//    }
//    //spi_i2s_data_transmit(SPI0, spi0_send_array[send_n++]);
//    for (uint8_t i = 0; i < size; i++)
//    {
//        spi_i2s_data_transmit(SPI0, *(data++));
//    }
//}

void SPI_transmit_self_recieve (uint8_t* data_handle) // NEED PULL CS TO LOW BEFORE CALL THIS FUNCTION
{
    while(RESET == spi_i2s_flag_get(SPI0, SPI_FLAG_TBE)) {
    }
    spi_i2s_data_transmit(SPI0, *data_handle);
    while(spi_i2s_flag_get(SPI0, SPI_FLAG_RBNE) == RESET) {
    }
    *data_handle = spi_i2s_data_receive(SPI0);
}

int fputc(int ch, FILE *f)
{
    usart_data_transmit(USART0, (uint8_t)ch);
    while(RESET == usart_flag_get(USART0, USART_FLAG_TBE));
    return ch;
}
//get tick
uint32_t sys_get_ms(void)
{
    return sys_counter;
}


//Handle min data after receive
uint8_t spi_data_buffer[251];
uint8_t byte_data_spi;
ble_config_t* ble_config;

void min_rx_callback(void *min_context, min_msg_t *frame)
{
    switch (frame->id)
    {
    case MIN_ID_PING_ESP_ALIVE:
        /* code */
        check_ping_esp_s = true;
        min_msg_t  min_ping_response;
        DEBUG_INFO ("PING OK\r\n");
        //DEBUG_INFO ("PAY LOAD:%s", frame->payload);        
        break;
    case MIN_ID_ESP32_STARTED:
        esp32_started_s = true;
        break;
    case MIN_ID_SEND_SPI_FROM_ESP32:    
//        memcpy(spi_data_send, frame->payload,frame->len);
//        spi_send_data (spi_data_send, strlen ((char*)spi_data_send));
//        ready_to_send = true;
        break;
    case MIN_ID_SEND_HEARTBEAT_MSG:
            
        break;
    case MIN_ID_SEND_BEACON_MSG:
        
        break;
    case MIN_ID_SEND_KEY_CONFIG:
        DEBUG_INFO ("RECEIVE KEY CONFIG");
        ble_config = (ble_config_t*) frame->payload;
        byte_data_spi = request_spi_message (spi_data_buffer, APP_SPI_KEY_CONFIG, ble_config);
        if ((memcmp(spi_data_buffer, "OK", byte_data_spi))) // thong nhat ban tin response ok sau
        {
            byte_data_spi = request_spi_message (spi_data_buffer, APP_SPI_KEY_CONFIG, ble_config); //
        }
        break;
    case MIN_ID_PING_ESP_DEAD:
        check_ping_esp_s = false;
        DEBUG_INFO ("PING DEAD, WILL RESET SOON\r\n");
        break;
    default:
        break;
    }
}

bool min_tx_byte(void *ctx, uint8_t byte)
{
	(void)ctx;
	usart_data_transmit(USART0, (uint8_t)byte);
    while(RESET == usart_flag_get(USART0, USART_FLAG_TBE));
	return true;
}

void send_min_data(min_msg_t *min_msg)
{
	min_send_frame(&m_min_context, min_msg);
}

