thucnguyen12/gd32/Template/main.c
void build_min_tx_data_from_spi(min_msg_t* min_msg, uint8_t* data_spi, uint8_t size)
{
    min_msg->id = MIN_ID_RECIEVE_SPI_FROM_GD32;
    memcpy (min_msg->payload, data_spi, size);
    min_msg->len = size;
}

//void lcd_clr_screen(void)
//{
//	u8g2_ClearBuffer(&m_u8g2);
//	u8g2_ClearDisplay(&m_u8g2);
//	//	u8g2_SetFont(&m_u8g2, u8g2_font_unifont_t_vietnamese1);
//	u8g2_FirstPage(&m_u8g2);
//}

//void lcd_display_content(const char *msg)
//{
//	lcd_clr_screen();

//	//lcd_display_header("JIG TEST");
//	do
//	{
//		u8g2_DrawUTF8(&m_u8g2,
//					  LCD_MEASURE_X_CENTER(u8g2_GetUTF8Width(&m_u8g2, msg)),
//					  20+LCD_MEASURE_Y_CENTER(u8g2_GetMaxCharHeight(&m_u8g2)),
//					  msg);
//	} while (u8g2_NextPage(&m_u8g2));
//	u8g2_SendBuffer(&m_u8g2);
//}


//void lcd_display_content_at_pos(const char *msg, u8g2_uint_t x, u8g2_uint_t y)
//{
//	//	lcd_clr_screen();
//	//	u8g2_ClearBuffer(&m_u8g2);
//	//	u8g2_FirstPage(&m_u8g2);
//	char tmp[24];

//	u8g2_SetFont(&m_u8g2, u8g2_font_6x13_tf);
//	do
//	{
//		u8g2_DrawUTF8(&m_u8g2, x, y, msg);
//	} while (u8g2_NextPage(&m_u8g2));
//	u8g2_SendBuffer(&m_u8g2);
//}

//LCD PLACE function

void lcd_clr_screen(void)
{
	u8g2_ClearBuffer(&m_u8g2);
	u8g2_ClearDisplay(&m_u8g2);
	u8g2_FirstPage(&m_u8g2);
}

void lcd_display_content(const char *msg)
{
	lcd_clr_screen();
	do
	{
		u8g2_DrawUTF8(&m_u8g2,
					  LCD_MEASURE_X_CENTER(u8g2_GetUTF8Width(&m_u8g2, msg)),
					  20+LCD_MEASURE_Y_CENTER(u8g2_GetMaxCharHeight(&m_u8g2)),
					  msg);
	} while (u8g2_NextPage(&m_u8g2));
	u8g2_SendBuffer(&m_u8g2);
}


void lcd_display_content_at_pos(const char *msg, u8g2_uint_t x, u8g2_uint_t y)
{
	//lcd_clr_screen();
	//	u8g2_ClearBuffer(&m_u8g2);
	//	u8g2_FirstPage(&m_u8g2);
	char tmp[24];

	u8g2_SetFont(&m_u8g2, u8g2_font_6x13_tf);
	do
	{
		u8g2_DrawUTF8(&m_u8g2, x, y, msg);
	} while (u8g2_NextPage(&m_u8g2));
	u8g2_SendBuffer(&m_u8g2);
}

void lcd_display_status (void)
{
    char counter[24];
    lcd_clr_screen();
    u8g2_ClearBuffer(&m_u8g2);

    // Display header
    //RTC_TimeTypeDef time;
    //HAL_RTC_GetTime(&hrtc, &time, RTC_FORMAT_BIN);
//    rtc_timestamp_get(&rtc_timestamp);
//    /* get the subsecond value of timestamp time, and convert it into fractional format */
//    uint32_t ts_subsecond;
//    uint8_t ts_subsecond_ss,ts_subsecond_ts,ts_subsecond_hs;
//    ts_subsecond = rtc_timestamp_subsecond_get();
//    ts_subsecond_ss=(1000-(ts_subsecond*1000+1000)/400)/100;
//    ts_subsecond_ts=(1000-(ts_subsecond*1000+1000)/400)%100/10;
//    ts_subsecond_hs=(1000-(ts_subsecond*1000+1000)/400)%10;
    sprintf(counter, "%02u:%02u:%02u", rtc_timestamp.rtc_timestamp_hour, rtc_timestamp.rtc_timestamp_minute, rtc_timestamp.rtc_timestamp_second);
    u8g2_SetFont(&m_u8g2, u8g2_font_unifont_t_vietnamese1); // can chon font cho header
    do
    {
        u8g2_DrawUTF8(&m_u8g2,
                      LCD_MEASURE_X_CENTER(u8g2_GetUTF8Width(&m_u8g2, counter)),
                      15,
                      counter);
    } while (u8g2_NextPage(&m_u8g2));

    u8g2_SetFont(&m_u8g2, u8g2_font_6x13_tf);
    if (network_status == WIFI_CONNECT)
    {
        sprintf(counter, "WIFI CONNECTED");
    }
    else if (network_status == ETH_CONNECT)
    {
        sprintf(counter, "ETH CONNECTED");
    }
    else if (network_status == GSM_CONNECT)
    {
        sprintf(counter, "GSM CONNECTED");
    }
    else
    {
        sprintf(counter, "LOST CONNECTION");
    }
    u8g2_DrawUTF8(&m_u8g2, 32, 38, counter);
    
    //sprintf(counter, "IMEI %s", final_jig_value.gsm_imei);
    //u8g2_DrawUTF8(&m_u8g2, 5,55, counter);
    u8g2_SendBuffer(&m_u8g2);
}

//#define DEVICE_TYPE_1 0x1
//#define DEVICE_TYPE_2 0x2
//#define DEVICE_TYPE_3 0x3
//#define DEVICE_TYPE_4 0x4
//#define DEVICE_TYPE_5 0x5
//#define DEVICE_TYPE_6 0x6
//#define DEVICE_TYPE_7 0x7



void build_device_type_string (uint8_t device_type, char* device_string)
{
    switch (device_type)
    {
        case APP_DEVICE_GW:
            sprintf (device_string, "Gateway");
        break;
        case APP_DEVICE_SENSOR_FIRE_DETECTOR:
            sprintf (device_string, "Fire detector");
        break;
        case APP_DEVICE_SENSOR_SMOKE_DETECTOR:
            sprintf (device_string, "Smoke detector");
        break;
        case APP_DEVICE_BUTTON_SOS:
            sprintf (device_string, "Button SOS");
        break;
        case APP_DEVICE_SPEAKER:
            sprintf (device_string, "Speaker");
        break;
        case APP_DEVICE_SENSOR_TEMP_DETECTOR:
            sprintf (device_string, "Overheat sensor");
        break;
        case APP_DEVICE_SENSOR_DOOR_DETECTOR:
            sprintf (device_string, "Door sensor");
        break;
        case APP_DEVICE_SENSOR_PIR_DETECTOR:
            sprintf (device_string, "PIR sensor");
        break;
        case APP_DEVICE_TOUCH_LIGHT:
            sprintf (device_string, "Light touch");
        break;
        case APP_DEVICE_TOUCH_WATER_WARMER:
            sprintf (device_string, "Water touch");
        break;
        case APP_DEVICE_TOUCH_AIR_CON:
            sprintf (device_string, "Air touch connector");
        break;
        case APP_DEVICE_SENSOR_TEMP_SMOKE:
            sprintf (device_string, "Temper smoke sensor");
        break;
        case APP_DEVICE_POWER_METER:
            sprintf (device_string, "Power metter");
        break;
        case APP_DEVICE_UNKNOWN:
            sprintf (device_string, "Device unknow");
        break;
        
        default:
        break;
    }
}

void lcd_display_trouble (trouble_info_of_note_t* trouble_info_table, uint8_t trouble_sensor_cnt)
{
    char counter[24];
    lcd_clr_screen();
    u8g2_ClearBuffer(&m_u8g2);
    u8g2_SetFont(&m_u8g2, u8g2_font_unifont_t_vietnamese1); // can chon font cho header
    
    sprintf(counter, "TIME %02u:%02u:%02u", (trouble_info_table[trouble_sensor_cnt]).time_got_trouble.hour,
                                   (trouble_info_table[trouble_sensor_cnt]).time_got_trouble.minute,
                                   (trouble_info_table[trouble_sensor_cnt]).time_got_trouble.second);
    do
    {
        u8g2_DrawUTF8(&m_u8g2,
                      LCD_MEASURE_X_CENTER(u8g2_GetUTF8Width(&m_u8g2, counter)),
                      15,
                      counter);
    }while (u8g2_NextPage(&m_u8g2));
#warning "dinh nghia device type"
    char dv_string[32];
    build_device_type_string(trouble_info_table->deviceType, dv_string);
    sprintf(counter, "%s", dv_string);
    u8g2_DrawUTF8(&m_u8g2, 32, 38, counter);
    u8g2_SetFont(&m_u8g2, u8g2_font_6x13_tf);
    sprintf(counter, "MAC ALARM:%s", (trouble_info_table[trouble_sensor_cnt]).MAC);
    u8g2_DrawUTF8(&m_u8g2, 32, 46, counter);
    u8g2_SendBuffer(&m_u8g2);
}



void SPI_transmit_recieve_msg (uint32_t target_port, uint32_t target_pin,uint8_t * data_send, uint32_t size, uint8_t* data_receive)
{
    gpio_bit_reset (target_port, target_pin);
    
    while(spi_i2s_interrupt_flag_get(SPI1, SPI_I2S_INT_FLAG_RBNE) != RESET) {
        *(data_receive++) = spi_i2s_data_receive(SPI0);
    }
    gpio_bit_set (target_port, target_pin);
}


void SPI_transmit_recieve (uint32_t target_port, uint32_t target_pin, uint8_t * data_send, uint32_t size, uint8_t* data_receive)
{
    gpio_bit_reset (target_port, target_pin);
    while(RESET == spi_i2s_flag_get(SPI0, SPI_FLAG_TBE)) {
    }
    for (uint8_t i = 0; i < size; i++)
    {
        spi_i2s_data_transmit(SPI0, *(data_send++));
    }
    while(spi_i2s_interrupt_flag_get(SPI1, SPI_I2S_INT_FLAG_RBNE) != RESET) {
        *(data_receive++) = spi_i2s_data_receive(SPI0);
    }
    gpio_bit_set (target_port, target_pin);
}

uint32_t rtt_tx(const void *buffer, uint32_t size)
{
    return SEGGER_RTT_Write(0, buffer, size);
}

uint8_t request_spi_message(uint8_t* p_out, uint8_t MSG_ID, void* input)
{
    nrf52_format_packet_t nrf52_local_packet;
    nrf52_local_packet.format.token = APP_GD32_SPI_TOKEN;
    nrf52_local_packet.format.msg_id = APP_SPI_PING_MSG;
    nrf52_local_packet.format.msg_length = 0;
    memset(&nrf52_local_packet.format.payload, 0, sizeof(nrf52_local_packet.format.payload));
    // need to send msg config
    if ((MSG_ID == APP_SPI_KEY_CONFIG) && (input != NULL))
    {
        input = (ble_config_t *) input;
        memcpy(&nrf52_local_packet.format.payload, input, sizeof(ble_config_t));
    }
    else if ((MSG_ID == APP_SPI_SYN_TIME) && (input != NULL))    
    {
        input = (uint32_t *) input;
        memcpy(&nrf52_local_packet.format.payload, input, sizeof(uint32_t));
    }
    /*Write*/
    /*nrF52 CS Pin*/
    gpio_bit_reset(GPIO_NRF_CS_PORT, GPIO_NRF_CS_PIN);
    DEBUG_INFO ("send spi msg");
    for(uint16_t i = 0; i < sizeof(nrf52_format_packet_t); i++)
    {
        uint32_t Timeout = 1000;
        //SPI_transmit_self_recieve (&(nrf52_local_packet.value[i]));  // if there are hardware UNCOMMENT THIS LINE 
        while(RESET == spi_i2s_flag_get(SPI0, SPI_FLAG_TBE) && Timeout) {
            if ((Timeout % 100) == 0)
//            fwdgt_counter_reload();
            Timeout--;
        }
            spi_i2s_data_transmit(SPI0, nrf52_local_packet.value[i]);
        while(spi_i2s_flag_get(SPI0, SPI_FLAG_RBNE) == RESET && Timeout) {        
            if ((Timeout % 100) == 0)
//            fwdgt_counter_reload();
            Timeout--;
        }
            nrf52_local_packet.value[i] = spi_i2s_data_receive(SPI0);
    }
    // wait until tranfer data completely
    while(SET == spi_i2s_flag_get(SPI0, SPI_STAT_TRANS)) {
    }
    // nRF52 CS PIN
    gpio_bit_set(GPIO_NRF_CS_PORT, GPIO_NRF_CS_PIN);
    // For debug print spi frame (comment this area if no need debug)
    for (uint8_t i = 0; i < 255; i++)
    {
        if((i %10) == 0)
        {
            DEBUG_RAW("\r\n");
        }
        DEBUG_RAW ("%x-",(uint8_t)nrf52_local_packet.value[i]);
        
