thucnguyen12/gd32/Template/main.c
    }
        DEBUG_RAW ("\r\n");
    // end debug 
    uint8_t ping_msg_length = 0;
    if(nrf52_local_packet.format.token == APP_GD32_SPI_TOKEN && nrf52_local_packet.format.msg_id == MSG_ID)
    {
        DEBUG_INFO("Found msg response\r\n");
        ping_msg_length = nrf52_local_packet.format.msg_length;
        if (MSG_ID == APP_SPI_PING_MSG)
        {
            app_beacon_ping_msg_t *p_ping_msg = (app_beacon_ping_msg_t*)&nrf52_local_packet.format.payload;
            /*<Only for Debug>*/
        
            DEBUG_INFO("Alarm value:%08x\r\nTotal Sensor count:%u\r\nPair mode:%d\r\nGateway Mac:", p_ping_msg->alarm_value.Value, p_ping_msg->sensor_count, p_ping_msg->in_pair_mode);
            for(uint8_t  i = 0; i < 6; i++)
            {
                DEBUG_RAW("%02x-", p_ping_msg->gateway_mac[i]);
            }
            DEBUG_RAW("\r\nAppKey");
            for(uint8_t  i = 0; i < 16; i++)
            {
                DEBUG_RAW("%02x-", p_ping_msg->mesh_key.appkey[i]);
            }
            DEBUG_RAW("\r\nnetKey");
            for(uint8_t  i = 0; i < 16; i++)
            {
                DEBUG_RAW("%02x-", p_ping_msg->mesh_key.netkey[i]);
            }
            DEBUG_RAW("\r\n");
        }
        else if (MSG_ID == APP_SPI_BEACON_MSG)
        {
            app_beacon_data_t *p_data_msg = (app_beacon_data_t*) &nrf52_local_packet.format.payload;
            DEBUG_INFO ("%x: %x: %x: %x: %x: %x\r\n", p_data_msg->device_mac[0],
                                                p_data_msg->device_mac[1],
                                                p_data_msg->device_mac[2],
                                                p_data_msg->device_mac[3],
                                                p_data_msg->device_mac[4],
                                                p_data_msg->device_mac[5]);
            
            DEBUG_INFO ("Gia tri thong tin %d\r\n", p_data_msg->beacon_tid.value);
            DEBUG_INFO ("pin hien tai: %d \r\n", p_data_msg->battery);
            DEBUG_INFO ("khoi hien tai: %d \r\n", p_data_msg->smoke_value);
            DEBUG_INFO ("nhiet hien tai: %d \r\n", p_data_msg->teperature_value);
            
            DEBUG_INFO ("APP BEACON MSG RECEIVE");
        }
        else if ((MSG_ID == APP_SPI_KEY_CONFIG) || (MSG_ID == APP_SPI_SYN_TIME)) /// config msg and syn time msg
        {
            DEBUG_INFO ("RECEIVE KEY RESPONSE");
            char * response_for_config = (char*) &nrf52_local_packet.format.payload;
            // if strstr (response_for_config, "CONFIG OK") { return ok no need send again}
        }
    }
    else
    {
            DEBUG_ERROR("Wrong ping response format\r\n");
    }
    
    
    memcpy (p_out, nrf52_local_packet.format.payload, ping_msg_length);
    // nRF52 CS PIN
    
    return ping_msg_length;
}


/*!
    \brief      main function
    \param[in]  none
    \param[out] none
    \retval     none
*/
void irc40k_config(void)
{
    /* enable IRC40K */
    rcu_osci_on(RCU_IRC40K);
    /* wait till IRC40K is ready */
    rcu_osci_stab_wait(RCU_IRC40K);
}

void rtc_pre_config(void)
{
    #if defined (RTC_CLOCK_SOURCE_IRC40K) 
          //rcu_osci_on(RCU_IRC40K); //use same clock source with watchdog so don't need turn it on again
          //rcu_osci_stab_wait(RCU_IRC40K);
          rcu_rtc_clock_config(RCU_RTCSRC_IRC40K);
  
          prescaler_s = 0x18F;
          prescaler_a = 0x63;
    #elif defined (RTC_CLOCK_SOURCE_LXTAL)
          rcu_osci_on(RCU_LXTAL);
          rcu_osci_stab_wait(RCU_LXTAL);
          rcu_rtc_clock_config(RCU_RTCSRC_LXTAL);
          prescaler_s = 0xFF;
          prescaler_a = 0x7F;
    #else
    #error RTC clock source should be defined.
    #endif /* RTC_CLOCK_SOURCE_IRC40K */

    rcu_periph_clock_enable(RCU_RTC);
    rtc_register_sync_wait();
}

static uint8_t convert_input_to_bcd_format(uint8_t value)
{
    uint32_t index = 0;
    uint32_t tmp[2] = {0, 0};
    if (value < 10)
    {
        tmp[0] = 0;
        tmp[1] = value;
    }
    else if ((value >= 10) && (value < 100))
    {
        tmp[0] = value / 10;
        tmp[1] = value % 10;
    }
    else
    {
        DEBUG_ERROR ("INPUT TIME VALUE WRONG: %d", value);
    }
    index = (tmp[1]) + ((tmp[0]) <<4);
    return index;
}
uint8_t convert_bcd_to_dec (uint8_t bcd)
{
   uint32_t index = 0;
   uint32_t tmp[2] = {0, 0};
   if (bcd < 0x10)
   {
       tmp[0] = 0;
       tmp[1] = bcd;
   }
   else
   {
       tmp[1] = bcd & 0x0f;
       tmp[0] = (bcd & 0xf0) >> 4;
   }
   index = (tmp[1]) + ((tmp[0])*10);
   return index;
}


void rtc_setup(date_time_t *t)
{
    /* setup RTC time value */
    uint32_t tmp_hh = 0xFF, tmp_mm = 0xFF, tmp_ss = 0xFF;

    rtc_initpara.rtc_factor_asyn = prescaler_a;
    rtc_initpara.rtc_factor_syn = prescaler_s;
    rtc_initpara.rtc_display_format = RTC_24HOUR;
    rtc_initpara.rtc_am_pm = RTC_AM;
    if (t == NULL)
    {
        rtc_initpara.rtc_year = 0x16;
        rtc_initpara.rtc_day_of_week = RTC_SATURDAY;
        rtc_initpara.rtc_month = RTC_APR;
        rtc_initpara.rtc_date = 0x30;
        rtc_initpara.rtc_hour = 0;
        rtc_initpara.rtc_minute = 0;
        rtc_initpara.rtc_second = 0;
    }
    else
    {
        rtc_initpara.rtc_year = convert_input_to_bcd_format (t->year);
        rtc_initpara.rtc_month = (t->month);
        rtc_initpara.rtc_date = convert_input_to_bcd_format (t->day);
        if (get_weekday (*t) == 0)
        {
           rtc_initpara.rtc_day_of_week = RTC_SUNDAY; 
        }
        else
        {
           rtc_initpara.rtc_day_of_week =  get_weekday (*t);
        }
        rtc_initpara.rtc_hour =(t->hour);
        rtc_initpara.rtc_minute = convert_input_to_bcd_format (t->minute);
        rtc_initpara.rtc_second = convert_input_to_bcd_format (t->second);
    }
    
    /* RTC current time configuration */
    if(ERROR == rtc_init(&rtc_initpara)){    
        DEBUG_INFO("** RTC time configuration failed! **\n\r");
    }else{
        DEBUG_INFO("** RTC time configuration success! **\n\r");
        rtc_show_timestamp();
        RTC_BKP0 = BKP_VALUE;
    }   
}

