thucnguyen12/gd32/Template/main.c
void rtc_show_timestamp(void)
{
    uint32_t ts_subsecond = 0;
    uint8_t ts_subsecond_ss,ts_subsecond_ts,ts_subsecond_hs ;
  
    rtc_timestamp_get(&rtc_timestamp);
    /* get the subsecond value of timestamp time, and convert it into fractional format */
    ts_subsecond = rtc_timestamp_subsecond_get();
    ts_subsecond_ss=(1000-(ts_subsecond*1000+1000)/400)/100;
    ts_subsecond_ts=(1000-(ts_subsecond*1000+1000)/400)%100/10;
    ts_subsecond_hs=(1000-(ts_subsecond*1000+1000)/400)%10;

    DEBUG_INFO("Get the time-stamp time: %0.2x:%0.2x:%0.2x .%d%d%d \n\r", \
          rtc_timestamp.rtc_timestamp_hour, rtc_timestamp.rtc_timestamp_minute, rtc_timestamp.rtc_timestamp_second,\
          ts_subsecond_ss, ts_subsecond_ts, ts_subsecond_hs);
}



int main(void)
{
    /* configure systick */
    systick_config();
    irc40k_config();
    board_hw_initialize();
    
    lwrb_init(&uart_rb, uart_buffer, sizeof(uart_buffer));
    m_min_setting.get_ms = sys_get_ms;
    m_min_setting.last_rx_time = 0x00;
	m_min_setting.rx_callback = min_rx_callback;
	m_min_setting.timeout_not_seen_rx = 5000;
	m_min_setting.tx_byte = min_tx_byte;
	m_min_setting.use_timeout_method = 0;

    m_min_context.callback = &m_min_setting;
	m_min_context.rx_frame_payload_buf = min_rx_buffer;
	min_init_context(&m_min_context);
    
    
    /* initilize the LEDs, USART and key */
//    gd_eval_led_init(LED1); 
//    gd_eval_led_init(LED2); 
//    gd_eval_led_init(LED3);
//    gd_eval_com_init(EVAL_COM);
//    gd_eval_key_init(KEY_WAKEUP, KEY_MODE_GPIO);
    
//    com_usart_init();
//    usart_enable(USART1);
//    //spi configuration
//    nvic_irq_enable (SPI0_IRQn, 1);
    spi_config ();
    spi_enable (SPI0);
    
//*********  CONFIG BACKUP VALUE AND RTC*******    
    /* enable access to RTC registers in backup domain */
    rcu_periph_clock_enable(RCU_PMU);
    pmu_backup_write_enable();
  
    rtc_pre_config();
    rtc_tamper_disable(RTC_TAMPER0);
  
    /* check if RTC has aready been configured */
    if (BKP_VALUE != RTC_BKP0){    
        rtc_setup (NULL); 
    }else{
        /* detect the reset source */
        if (RESET != rcu_flag_get(RCU_FLAG_PORRST)){
            DEBUG_INFO("power on reset occurred....\n\r");
        }else if (RESET != rcu_flag_get(RCU_FLAG_EPRST)){
            DEBUG_INFO("external reset occurred....\n\r");
        }
        DEBUG_INFO("no need to configure RTC....\n\r");
               
        //rtc_show_time(); // WE NEED DISPLAY TIME ON LCD ONCE A SECOND
    }
    // app debug
    app_debug_init(sys_get_ms,NULL);
    app_debug_register_callback_print(rtt_tx);
    DEBUG_INFO ("APP DEBUG OK\r\n");
    while(RESET == usart_flag_get(USART0, USART_FLAG_TC));
    usart_interrupt_enable(USART0, USART_INT_RBNE);
	//usart_interrupt_enable(USART0, USART_INT_TBE);
    uint8_t databuff1[128];
    while (0)
    {   
        //min_send_frame(&m_min_context, (min_msg_t*)&ping_min_msg);
        DEBUG_INFO ("STILL RUN \r\n");
        uint16_t uart_data_leng = lwrb_read (&uart_rb, databuff1, 128);
        if (uart_data_leng)
        {
            DEBUG_INFO ("DATA UART FROM ESP32");
            min_rx_feed (&m_min_context, databuff1, uart_data_leng);
        }
        delay_1ms (200);
    }
#if 1 // paralle mode
	u8g2_Setup_st7920_p_128x64_f(&m_u8g2, U8G2_R2, u8x8_byte_8bit_8080mode, u8g2_gpio_8080_update_and_delay);
#else
#warning "do nothing"
//	software_spi_cfg_t spi_cfg;
//	spi_cfg.cs_out = software_spi_set_cs;
//	spi_cfg.miso_in = software_spi_read_miso;
//	spi_cfg.mosi_out = software_spi_set_mosi;
//	spi_cfg.sck_out = software_spi_set_sck;
//	software_spi_inititalize(&spi_cfg);
//	u8g2_Setup_st7920_s_128x64_f(&m_u8g2, U8G2_R0, u8x8_byte_3wire_sw_spi, u8g2_gpio_3w_spi_update_and_delay);
#endif
	u8g2_InitDisplay(&m_u8g2);	   // send init sequence to the display, display is in sleep mode after this,
	u8g2_SetPowerSave(&m_u8g2, 0); // wake up display
	u8g2_ClearBuffer(&m_u8g2);
	u8g2_ClearDisplay(&m_u8g2);
    
    
//    /* print out the clock frequency of system, AHB, APB1 and APB2 */
//    printf("\r\nCK_SYS is %d", rcu_clock_freq_get(CK_SYS));
//    printf("\r\nCK_AHB is %d", rcu_clock_freq_get(CK_AHB));
//    printf("\r\nCK_APB1 is %d", rcu_clock_freq_get(CK_APB1));
//    printf("\r\nCK_APB2 is %d", rcu_clock_freq_get(CK_APB2));
    
    static uint32_t now = 0;
    static uint32_t last_time = 0;
    static uint32_t last_time_ping = 0;
    uint8_t databuff[128];
    size_t btr_m;
    min_msg_t min_data_buff;
    
    //lcd_clr_screen();
    //lcd_display_content ("lcd test");
    DEBUG_INFO ("PASS LCD \r\n");
    // wwdgt_config(4096,2048,WWDGT_CFG_PSC_DIV8);
    // wwdgt_enable();
    DEBUG_INFO ("enable wdt \r\n");
    gpio_bit_set(GPIO_ESP_EN_PORT, GPIO_ESP_EN_PIN);
    while(1){
        /* update WWDGT counter */
       // wwdgt_counter_update(4096);
        //DEBUG_INFO ("reset wdt cnter\r\n"); 
        
        now = sys_get_ms();
        //feed data to min progress

        uint16_t uart_data_leng = lwrb_read (&uart_rb, databuff, 1);
        if (uart_data_leng)
        {
            DEBUG_VERBOSE ("DATA UART FROM ESP32\r\n");
            min_rx_feed (&m_min_context, databuff, uart_data_leng);
        }
        if (check_ping_esp_s)
        {
            check_ping_esp_s = false;
            last_time = now;
        }
        
        if (((now - last_time) > 6000) && (!check_ping_esp_s) && esp32_started_s)
        {
            // reset esp32
          last_time = now;
            DEBUG_INFO ("TIME OUT RESET ESP32\r\n");
            gpio_bit_reset(GPIO_ESP_EN_PORT, GPIO_ESP_EN_PIN);
            
            delay_1ms (1000);
            
            gpio_bit_set(GPIO_ESP_EN_PORT, GPIO_ESP_EN_PIN);
            continue;
            //restart loop
        }
        app_beacon_ping_msg_t* ble_status;
        if (((now - last_time_ping) > 1000))
        {
            last_time_ping = now;
            static uint8_t spi_msg_data[251];
//            if (!in_pair_mode)
//            {
                uint8_t byte_read = request_spi_message (spi_msg_data, APP_SPI_PING_MSG, NULL);
                
                // check spi data
                ble_status = (app_beacon_ping_msg_t*)spi_msg_data;
                // process and send data to esp (for ping msg)
                {
                    min_msg_t min_beacon_ping_msg;
                    min_beacon_ping_msg.id = 0x12;
                    min_beacon_ping_msg.payload = ble_status;
                    min_beacon_ping_msg.len = byte_read;
                    send_min_data (&min_beacon_ping_msg);
                }
//                lcd_display_status ();// hien thi trang thai khi khong o trang thai pair mode
//            }
        }    
    }
}

static void delay_ns(uint32_t ns)
{
	for (uint32_t i = 0; i < ns * 2; i++)
	{
		__NOP();
		__NOP();
		__NOP();
		__NOP();
		__NOP();
		__NOP();
	}
}

uint8_t u8g2_gpio_8080_update_and_delay(U8X8_UNUSED u8x8_t *u8x8, U8X8_UNUSED uint8_t msg, U8X8_UNUSED uint8_t arg_int, U8X8_UNUSED void *arg_ptr)
{
	switch (msg)
	{
	// Initialize SPI peripheral
	case U8X8_MSG_GPIO_AND_DELAY_INIT:
	{
		gpio_bit_set(GPIO_LCD_PWM_PORT, GPIO_LCD_PWM_PIN);
	}
	break;

	case U8X8_MSG_DELAY_MILLI:
	{
        delay_1ms(arg_int);
	}
	break;

	// Function which delays 10us
	case U8X8_MSG_DELAY_10MICRO:
	{
		for (volatile uint32_t n = 0; n < 720 * arg_int; n++)
		{
			__NOP();
			__NOP();
		}
	}
	break;
	// Function which delays 100ns
	case U8X8_MSG_DELAY_100NANO:
	{
		delay_ns(100 * arg_int);
	}
	break;

